//==================================================================================
//| 文件名称 | bsp_usart.h
//|----------|----------------------------------------------------------------------
//| 文件功能 | 向上层提供统一的接口 需根据不同的平台更改底层
//|----------|----------------------------------------------------------------------
//| 输入参数 | 无
//|----------|----------------------------------------------------------------------
//| 返回参数 | 无
//==================================================================================
#ifndef __BSP_USART_H__
#define __BSP_USART_H__

#include "bsp.h"

typedef struct _DEV_SERIALPORT  Dev_SerialPort;

#define UART_WORDLENGTH_8B                  0x00000000U
#define UART_WORDLENGTH_9B                  ((uint32_t)0)

#define UART_STOPBITS_1                     0x00000000U
#define UART_STOPBITS_2                     ((uint32_t)0)

#define UART_PARITY_NONE                    0x00000000U
#define UART_PARITY_EVEN                    ((uint32_t)0)
#define UART_PARITY_ODD                     ((uint32_t)(0 | 0))

#define UART_HWCONTROL_NONE                  0x00000000U
#define UART_HWCONTROL_RTS                   ((uint32_t)0)
#define UART_HWCONTROL_CTS                   ((uint32_t)0)
#define UART_HWCONTROL_RTS_CTS               ((uint32_t)(0 | 0))

#define UART_MODE_RX                        ((uint32_t)0)
#define UART_MODE_TX                        ((uint32_t)0)
#define UART_MODE_TX_RX                     ((uint32_t)(0 |0))

extern Dev_SerialPort COM1;
extern Dev_SerialPort COM2;
extern Dev_SerialPort COM3;
extern Dev_SerialPort COM4;

struct _DEV_SERIALPORT{
    /*  配置参数  */
    const INT8S *       puch_Name;
    INT32U              ul_BaudRate;
    INT32U              ul_WordLength;
    INT32U              ul_StopBits;
    INT32U              ul_Parity;
    INT32U              ul_HwFlowCtl;
    INT32U              ul_Mode;
    
    /*  发送缓冲区相关设置 */
    INT8U*              puch_TxBuff;
    INT16U              uin_TxLen;
    INT16U              uin_TxCount;
    
    /* 接受缓冲区相关设置 */
    INT8U*              puch_RxBuff;
    INT16U              uin_RxLen;
    INT16U              uin_RxCount;
    
    
    /*  硬件回调函数  */
    void (*cb_SendStart)(void * pv_dev);
    void (*cb_SendComplete)(void * pv_dev);
    void (*cb_RecvReady)(void * pv_dev, INT8U* puch_Buff, INT16U uin_Len);
    void (*cb_ErrHandle)(void * pv_dev);
    

    /*  底层句柄      */
    void * pv_UartHandle; //句柄
};


//==================================================================================
//| 函数名称 | Bsp_UartOpen
//|----------|----------------------------------------------------------------------
//| 函数功能 | 配置并打开串口
//|----------|----------------------------------------------------------------------
//| 输入参数 | pstPort  串口配置结构体
//|----------|----------------------------------------------------------------------
//| 返回参数 | -1 打开失败, 0 打开成功
//|----------|----------------------------------------------------------------------
//| 函数设计 | wjb
//==================================================================================
BOOL Bsp_UartOpen(Dev_SerialPort* pst_Dev);


//==================================================================================
//| 函数名称 | Bsp_UartClose
//|----------|----------------------------------------------------------------------
//| 函数功能 | 关闭串口
//|----------|----------------------------------------------------------------------
//| 输入参数 | pstPort  串口配置结构体
//|----------|----------------------------------------------------------------------
//| 返回参数 | -1 打开失败, 0 打开成功
//|----------|----------------------------------------------------------------------
//| 函数设计 | wjb
//==================================================================================
BOOL Bsp_UartClose(Dev_SerialPort* pst_Dev);


//==================================================================================
//| 函数名称 | Bsp_UartSendBlock
//|----------|----------------------------------------------------------------------
//| 函数功能 | 串口发送(阻塞的)
//|----------|----------------------------------------------------------------------
//| 输入参数 | pst_Dev:串口控制句柄 puch_Buff: 发送缓冲区 uin_Len:发送缓冲区长度
//|----------|----------------------------------------------------------------------
//| 返回参数 | -1 打开失败, 0 打开成功
//|----------|----------------------------------------------------------------------
//| 函数设计 | wjb
//==================================================================================
BOOL Bsp_UartSendBlock(Dev_SerialPort *pst_Dev, INT8U* puch_Buff, INT16U uin_Len);


//==================================================================================
//| 函数名称 | Bsp_UartSend
//|----------|----------------------------------------------------------------------
//| 函数功能 | 串口发送(非阻塞)
//|----------|----------------------------------------------------------------------
//| 输入参数 | pst_Dev:串口结构体 puch_Buff:发送缓冲区 uin_Len:发送缓冲区长度
//|----------|----------------------------------------------------------------------
//| 返回参数 | FALSE:参数有误, TRUE:发送成功
//|----------|----------------------------------------------------------------------
//| 函数设计 | wjb
//==================================================================================
BOOL Bsp_UartSend(Dev_SerialPort *pst_Dev, INT8U* puch_Buff, INT16U uin_Len);

//==================================================================================
//| 函数名称 | Bsp_Printf
//|----------|----------------------------------------------------------------------
//| 函数功能 | 串口打印(非阻塞)
//|----------|----------------------------------------------------------------------
//| 输入参数 | pst_Dev:串口结构体 puch_Buff:发送缓冲区 uin_Len:发送缓冲区长度
//|----------|----------------------------------------------------------------------
//| 返回参数 | FALSE:参数有误, TRUE:发送成功
//|----------|----------------------------------------------------------------------
//| 函数设计 | wjb
//==================================================================================
void Bsp_UartPrintf(const char * Format,...);

#endif
